x=[-0.5200    1.8539 
    2.5849    2.2481 
    0.9919    1.9234 
    2.9443    3.7382 
   -0.4240    3.6220 
    1.7762    2.6264 
    2.0581    2.0918 
    1.5754    1.1924 
    1.7971    1.5387 
    0.4869    0.5940 
    7.8736    7.6255 
    8.1850    7.5291 
    9.3666    9.7513 
    8.4139    8.7532 
   10.5374    8.0650 
    9.1401    7.7072 
    7.1372    8.0828 
    8.5458    8.7662 
    8.3479   10.2368 
    9.1033    8.3269 
    3.7794    4.8633 
    3.7210    4.6794 
    3.2663    4.5548 
    3.9355    5.0016 
    2.5560    5.2594 
    4.6123    4.0442 
    2.6765    3.6859 
    3.3384    4.2267];
plot(x(:,1),x(:,2),'.');
xlabel('x1');ylabel('x2')
z(1,:)=x(1,:);z(2,:)=x(2,:);z(3,:)=x(3,:);%z(4,:)=x(4,:);%初始聚类中心
newz=z;%存储每一次更新后的聚类中心
y1=[];y2=[];y3=[];%y4=[];%存储各类样本
k=1;
while k~=0 %判断聚类中心是否跟前一次发生变化
    z=newz;
    y1=[];y2=[];y3=[];%y4=[];
for i=1:size(x,1)
    for j=1:3
        d(j)=norm(x(i,:)-z(j,:));
    end
    [sortd id]=sort(d);
    if id(1)==1
        y1=[y1;x(i,:)];
    elseif id(1)==2
        y2=[y2;x(i,:)];
    elseif id(1)==3
        y3=[y3;x(i,:)];
    else
        y4=[y4;x(i,:)];
    end
end
newz(1,:)=sum(y1)./size(y1,1);
newz(2,:)=sum(y2)./size(y2,1);
newz(3,:)=sum(y3)./size(y3,1);
%newz(4,:)=sum(y4)./size(y4,1);
z_=newz-z;
k=sum(abs(z_(:)));
if k<=0.0001
    k=0;
end
end
figure;
plot(y1(:,1),y1(:,2),'b.',newz(1,1),newz(1,2),'b*');
hold on
plot(y2(:,1),y2(:,2),'r.',newz(2,1),newz(2,2),'r*');
hold on
plot(y3(:,1),y3(:,2),'g.',newz(3,1),newz(3,2),'g*');
hold on;
%plot(y4(:,1),y4(:,2),'k.',newz(4,1),newz(4,2),'k*');
xlabel('x1');ylabel('x2');
legend('* 表示相应聚类中心');
disp('第一类包含的样本数据');disp(y1);disp('第一类聚类中心');disp(newz(1,:));
disp('第二类包含的样本数据');disp(y2);disp('第二类聚类中心');disp(newz(2,:));
disp('第三类包含的样本数据');disp(y3);disp('第三类聚类中心');disp(newz(3,:));
%disp('第四类包含的样本数据');disp(y4);disp('第四类聚类中心');disp(newz(4,:));

    
    
